In [1]:
# importing libraries

import pandas as pd
import numpy as np
import psycopg2
import sqlalchemy

In [2]:
# reading the datasets
df_orders = pd.read_csv('data/orders.csv', engine='pyarrow').convert_dtypes()
df_aisles = pd.read_csv('data/aisles.csv', engine='pyarrow').convert_dtypes()
df_department = pd.read_csv('data/departments.csv', engine='pyarrow').convert_dtypes()
df_order_products = pd.read_csv('data/order_products__prior.csv', engine='pyarrow').convert_dtypes()
df_products = pd.read_csv('data/products.csv', engine='pyarrow').convert_dtypes()

In [3]:
df_orders.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,<NA>
1,2398795,1,prior,2,3,7,15
2,473747,1,prior,3,3,12,21
3,2254736,1,prior,4,4,7,29
4,431534,1,prior,5,4,15,28

In [4]:
df_aisles

     aisle_id                       aisle
0           1       prepared soups salads
1           2           specialty cheeses
2           3         energy granola bars
3           4               instant foods
4           5  marinades meat preparation
..        ...                         ...
129       130    hot cereal pancake mixes
130       131                   dry pasta
131       132                      beauty
132       133  muscles joints pain relief
133       134  specialty wines champagnes

[134 rows x 2 columns]

In [5]:
df_department.head()

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

In [6]:
df_order_products.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [7]:
df_products.head()

,product_id,product_name,aisle_id,department_id
0,1,Chocolate Sandwich Cookies,61,19
1,2,All-Seasons Salt,104,13
2,3,Robust Golden Unsweetened Oolong Tea,94,7
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1
4,5,Green Chile Anytime Sauce,5,13

In [3]:
# connecting python to postgresql
try:
    conn= psycopg2.connect(dbname="ecomm_analysis", user='postgres', password='postgres', port=5432)
except:
    print('connection was unsuccessful')

In [4]:
cur = conn.cursor()

In [5]:
engine = sqlalchemy.create_engine('postgresql+psycopg2://postgres:postgres@localhost/ecomm_analysis')

In [11]:
# create table aisles in postgresql
cur.execute("""
            CREATE TABLE aisles (
            aisle_id INT PRIMARY KEY,
            aisle VARCHAR(255)
            )
""")

In [12]:
# create table departments in postgresql
cur.execute("""
            CREATE TABLE departments (
            department_id INT PRIMARY KEY,
            department VARCHAR(255)
            )
""")

In [13]:
# create table products
cur.execute("""
            CREATE TABLE products (
            product_id INT PRIMARY KEY,
            product_name VARCHAR(255),
            aisle_id INT,
            department_id INT,
            FOREIGN KEY (aisle_id) REFERENCES aisles(aisle_id),
            FOREIGN KEY (department_id) REFERENCES departments(department_id)
            )       
""")

In [14]:
#cur.execute("rollback")

In [15]:
df_orders.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,<NA>
1,2398795,1,prior,2,3,7,15
2,473747,1,prior,3,3,12,21
3,2254736,1,prior,4,4,7,29
4,431534,1,prior,5,4,15,28

In [16]:
df_orders = df_orders.drop('eval_set', axis=1)

In [17]:
# create table orders
cur.execute("""
            CREATE TABLE orders (
            order_id INT PRIMARY KEY,
            user_id INT,
            order_number INT,
            order_dow INT,
            order_hour_of_day INT,
            days_since_prior_order INT
            )       
""")

In [30]:
# create table order_products
cur.execute("""
            CREATE TABLE order_products (
            order_id INT,
            product_id INT,
            add_to_cart_order INT,
            reordered INT,
            PRIMARY KEY (order_id, product_id),
            FOREIGN KEY (order_id) REFERENCES orders(order_id),
            FOREIGN KEY (product_id) REFERENCES products(product_id)
            )       
""")

In [31]:
conn.commit()

In [25]:
# inserting data from df_aisles to aisles table in postgresql
df_aisles.to_sql('aisles', con=engine, if_exists='append', index=False)

134

In [28]:
# inserting data from df_department to departments table in postgresql
df_department.to_sql('departments', con=engine, if_exists='append', index=False)

21

In [27]:
# inserting data from df_orders to orders table in postgresql
df_orders.to_sql('orders', con=engine, if_exists='append', index=False)

83

In [29]:
# inserting data from df_products to products table in postgresql
df_products.to_sql('products', con=engine, if_exists='append', index=False)

688

In [7]:
# inserting data from df_order_products to order_products table in postgresql

# to_sql command is slow & takes a lot of memory. so we have used a different method for this large data set
import io

# convert the dataframe to a csv file-like object
csv_buffer = io.StringIO()
df_order_products.to_csv(csv_buffer, index=False, header=False)

# use the COPY command to load the csv file into the table
csv_buffer.seek(0)
cur.copy_from(csv_buffer, 'order_products', sep=',')

In [22]:
conn.commit()